{"AllVacancy": [{"Профессия": "Инженер-программист", "Заработная плата": 100000, "Ссылка на вакансию": "https://www.superjob.ru/vakansii/inzhener-programmist-45842848.html", "Требования к работе": "Обязанности:\n\n• Участие в разработке систем гиростабилизации подвижных объектов. \n• Разработка и реализация протоколов взаимодействия с контроллером управления систем гиростабилизации. \n• Написание программного кода для управления контроллером систем стабилизации. \n• Разработка ПО пользовательского интерфейса для ПЭВМ и одноплатных компьютеров типа Raspberry Pi. \n• Реализация взаимодействия с периферийными устройствами по стандартным интерфейсам (RS232, UART, RS485, SPI, I2C, Ethernet).\nТребования:\n\n• Высшее профессиональное (техническое) образование. \n• Знание С/С++, знание языка Python является плюсом.\n• Знание QT. \n• Опыт работы с микрокомпьютерами. \n• Знание ОС семейства Linux. \n• Понимание работы систем гиростабилизации. \n• Чтения принципиальных электрических схем и знание Altium Designer является плюсом.\nУсловия:\n\n• Работа в ведущем техническом вузе страны, в городе Долгопрудный (Рядом со станцией Новодачная МЦД-1, или 15 минут от метро Алтуфьево или Ховрино). \n• Оформление в соответствии с ТК РФ, официальная заработная плата. \n• Возможности профессионального развития. \n• Оплачиваемый отпуск, больничный лист. \n• График работы: 5/2, с 09:00 до 18:00, возможно работа в удаленном режиме. \n• Заработная плата: от 100 000 рублей. \n• Молодой активный коллектив. \n• Возможность бесплатного посещения бассейна и тренажерного зала. \n• В соответствии с ТК РФ (ст.331), работники сферы образования обязаны предоставить справку о наличии (отсутствии) судимости и (или) факта уголовного преследования, срок изготовления которой может быть до 30 дней, просим заранее позаботиться о её получении."}, {"Профессия": "Data Scientist", "Заработная плата": "З/П не указана", "Ссылка на вакансию": "https://www.superjob.ru/vakansii/data-scientist-46185192.html", "Требования к работе": "Обязанности:\n• Использовать алгоритмы машинного обучения для решения бизнес-задач \n• Исследовать данные с целью получения новых признаков \n• Разрабатывать требования для сбора данных, дизайн A/B тестов \n• Заниматься написанием эффективного кода для получения агрегатов данных \n• Развивать инфраструктуру для автоматического построения и использования моделей машинного обучения \nТребования:\n• Высшее техническое образование \n• Уверенное знание SQL и готовность писать эффективные запросы\n• Уверенное владение Python (библиотеки работы с данными)\n• Опыт использования и внедрения алгоритмов машинного обучения\n• Знание базовых алгоритмов и структур данных, понимание плюсов и минусов \n• Уверенное знание математической статистики, умение применять для решения задач \n• Технический английский на уровне чтения статей и участия в конференциях \nУсловия:\n• формат работы;\n• График работы: 5/2; 8.00-17.00, 9.00-18.00 или 10.00-19.00 (на выбор);\n• Полугодовой бонус;\n• ДМС - после испытательного срока;\n• Дисконтная карта на продукцию 30% магазинов сети + корпоративные скидки и специальные условия от партнеров;\n• Обучение - доступно внутреннее и внешнее обучение, проводим внутренние митапы, техтолки, посещаем профильные конференции;\n• Некоторые бонусы предоставляются по принципу \"кафетерия\". Расскажем об этом подробнее при первом контакте."}, {"Профессия": "Аналитик информационной безопасности SOC L2 Middle soc analyst L2", "Заработная плата": 100000, "Ссылка на вакансию": "https://www.superjob.ru/vakansii/analitik-informacionnoj-bezopasnosti-soc-l2-middle-soc-analyst-l2-46547022.html", "Требования к работе": "Обязанности:\n \n• Мониторинг и анализ событий информационной безопасности от различных источников в SIEM системе / Threat Hunting платформе;\n \n• Выполнение роли выделенного клиентского аналитика 2-ой линии Центра мониторинга и реагирования на киберугрозы;\n \n• Адаптация сценариев выявления инцидентов в SIEM системе / Threat Hunting платформе под особенности инфраструктур клиентов;\n \n• Фильтрация ложных срабатываний сценариев выявления инцидентов в используемой SIEM системе / Threat Hunting платформе;\n \n• Реагирование и оповещение заказчиков об инцидентах ИБ в соответствии с установленным SLA;\n \n• Расследование типовых и нетиповых инцидентов ИБ, подготовка рекомендаций для заказчиков по инцидентам ИБ;\n \n• Работа с EDR решением: написание правил, расследование инцидентов;\n \n• Проведение работ по практической оценке защищённости Ит инфраструктуры;\n \n• Взаимодействие с заказчиками по вопросам реагирования на инциденты ИБ;\n \n• Разработка планов реагирования на инциденты ИБ (playbook-и);\n \n• Участие в разработке новых сценариев выявления инцидентов в SIEM / Threat Hunting платформе;\n \n• Наставничество над группой аналитиков 1-ой линии.\n \nТребования:\n \n• Высшее техническое образование;\n \n• Знание сетевых технологий (в объеме сертификации CCNA);\n \n• Знание операционных систем Windows/Linux на уровне администратора;\n \n• Уверенное знание современных тактик и техник атакующих, основных векторов атак на корпоративные инфраструктуры, способов их обнаружения и противодействия;\n \n• Понимание классификации современного вредоносного ПО;\n \n• Опыт работы с SIEM системами (желательно ELK стэк);\n \n• Опыт работы с СЗИ – IDS\\WAF\\NGFW\\AV\\EDR;\n \n• Опыт анализа логов от различных систем, умение их правильно интерпретировать;\n \n• Будет дополнительным преимуществом: опыт программирования на Python/Go для автоматизации рутинных задач;\n \n• Будет дополнительным преимуществом: наличие профильных сертификаций (SANS, Offensive Security, eLearnSecurity, EC-Council).\n \nУсловия:\n \n• Оформление по ТК РФ;\n \n• Полная занятость;\n \n• Возможность профессионального и карьерного роста;\n \n• Заработная плата по результатам собеседования."}, {"Профессия": "DevOps Engineer", "Заработная плата": "З/П не указана", "Ссылка на вакансию": "https://www.superjob.ru/vakansii/devops-engineer-34424249.html", "Требования к работе": "SuperJob — это инновационная IT-компания, которая помогает соискателям найти работу, а работодателям — приобрести ценного сотрудника.\nЕжемесячно нашим сервисом пользуются миллионы соискателей и десятки тысяч работодателей, среди которых РЖД, Мегафон, МТС, Леруа Мерлен, Почта России, Сбербанк, Альфа-Банк, Ригла и многие другие. Мы активно развиваем нашу платформу и делаем ее лучше, подтверждая миссию «Работа должна доставлять удовольствие!»\nМы ожидаем от кандидата опыт:\n• Администрирования Linux.\n• Настройки и эксплуатации CI/CD.\n• Программирования (скрипты Bash/PHP/Python/Go).\n• Настройки и эксплуатации web-проектов.\n• Использования систем мониторинга.\nЧем предстоит заниматься:\n• Управлять мониторингом zabbix, grafana.\n• Создавать и развивать собственные инструменты мониторинга и профайлинга для внутренних сервисов (php, nodejs) и для используемого стороннего ПО.\n• Реагировать на инциденты, не теряя присутствия духа.\n• Поддерживать актуальный план восстановления в случае сбоев.\n• Проводить нагрузочное тестирование новых сервисов, новых версий и новых конфигураций для mariadb и других серверов.\n• Находить узкие места в архитектуре проекта и приложений.\n• Рулить конфигурацией сервисов nginx, mariadb, clickhouse, apache, rabbitmq и других.\n• Писать плейбуки и роли для ansible для конфигурации и деплоя.\n• Контейнеризировать новые сервисы и поддерживать старые.\n• Поддерживать стороннее ПО (sentry, testrail, confluence, jira, bitbucket, teamcity).\n• Рулить процессом continuous integration и deployment.\nБудет плюсом опыт:\n• Администрирования систем виртуализации.\n• Администрирования баз данных SQL, NoSQL.\n• Администрирования высоконагруженного web-проекта.\nМы используем в работе свой дата-центр, пару сотен серверов, CentOs/Virtuozzo, Git, Nginx, Apache, NodeJS, Bash/Sh, PHP, Python, Rust, Go, MariaDB/MySql, PostgreSQL, Redis, Sphinx, RabbitMQ, Memcache, ClickHouse, ELK, Graphite/Grafana, Zabbix, TeamCity, Jenkins, Docker, Ansible, Nexus, Vault, Atlassian Jira/Confluence/BitBucket.\nСвоему будущему коллеге мы предлагаем:\n• Работу на одном из самых быстрорастущих рынков - HRTech.\n• Высокую инженерную культуру.\n• Непрерывное профессиональное развитие внутри компании.\n• Возможность стать частью сплоченной команды, любящей свое дело.\n• Оформление по ТК РФ: полностью официальные оклад и премии.\n• Современный офис в 10 минутах пешей прогулки от станций метро Пушкинская/Маяковская/Новослободская.\n• Спортивный уголок.\n• Комфортную зону отдыха.\n• Кофе-поинты с вкуснейшим кофе и вендинговым аппаратом.\n• Оборудованное просторное место для питания.\n• Оплату проезда общественным транспортом."}, {"Профессия": "Учитель информатики и робототехники", "Заработная плата": 80000, "Ссылка на вакансию": "https://www.superjob.ru/vakansii/uchitel-informatiki-i-robototehniki-39720503.html", "Требования к работе": "Обязанности:\n\nПреподавание учебных дисциплин, организация учебной деятельности обучающихся по освоению учебных дисциплин; педагогический контроль и оценка освоения образовательной программы в процессе промежуточной и итоговой аттестации; разработка программно-методического обеспечения учебных дисциплин.\nТребования:\nРезультат прохождения предметного тренинга МЦКО в формате ЕГЭ не ниже высокого уровня;\nНаличие справки об отсутствии судимости;\nЖелательно высшее профессиональное образование (бакалавриат, специалитет, магистратура);\nНавыки работы с робототехникой; с языками программирования (в т.ч. язык КуМир, Python).\nЖелательно обладать компетенциями в области искусственного интеллекта / работы с большими данными / технологий связи / информационной безопасности.\nУсловия:\n• Оформление по ТК РФ;\n• Стабильная заработная плата;\n• Школа является участницей городского проекта \"IT-Вертикаль\", \"ИТ-класс в московской школе\";\n• Пешая доступность от платформы \"Лось\", м. ВДНХ."}, {"Профессия": "Инженер-радиоэлектронщик 1 категории", "Заработная плата": 100000, "Ссылка на вакансию": "https://www.superjob.ru/vakansii/inzhener-radioelektronschik-1-kategorii-43148990.html", "Требования к работе": "Обязанности:\n\n - участие в проектировании устройств по ТЗ\n- написание программ для микроконтроллеров различных производителей (Atmel, STM32 и др.)\n- написание прикладных программ для ПК\n- разработка и согласование технических заданий и технических условий. \n\nТребования:\n - высшее (техническое) образование\n- знание С++, Python, Java\n- опыт работы с контроллерами Atmel, Cortex\n- приветствуются знания схемотехники, оптоэлектроники, умение паять и т.п. \n\nУсловия:\n- работникам ПАО \"Радиофизика\" предоставляется право на отсрочку от призыва на военную службу по мобилизации;\n- стабильная, официальная заработная плата;\n- периодическая индексация заработной платы;\n- периодический медицинский осмотр;\n- соц. пакет: дополнительное медицинское обслуживание;\n- ст. м. Планерная, ул. Героев Панфиловцев, д. 10 (шаговая доступность от станции метро)."}, {"Профессия": "Программист Phyton, Java Script", "Заработная плата": "З/П не указана", "Ссылка на вакансию": "https://www.superjob.ru/vakansii/programmist-phyton-46425973.html", "Требования к работе": "Обязанности: \n• Работа по обработке данных API и протоколов низкого уровня.\n• Доработка существующей интеграции технических средств охраны с ПО на OC «Astra Linux».\n• Создание интеграции с другими средствами охраны на основе открытого API.\nТребования: \n• \nЗнание языков программирования и уверенное владение языками программирования Phyton, Java Script.\n• \nЗнание особенностей построения кода в средах ОС Linux.\n• \nУмение правильно писать код («культура написания – чтобы можно было разобраться»).\n• \nУмение отлаживать рабочий код, устраняя ошибки.\n• \nУмение оптимизировать коды программ, понимать суть ветвления и слияния.\n• \nХорошее знание математики, основных алгоритмов.\n• \nПунктуальность.\nУсловия: \n• Работа в компании - лидере производства и торговли металлоконструкциями - мы на рынке уже более 14 лет!\n• Предполагается проектная занятость продолжительностью до 1 года. В дальнейшем может рассматриваться постоянное сотрудничество, участие в других проектах компании.\n• График работы гибридный: преимущественно удаленная работа, присутствие в офисе необходимо только для участия в ключевых совещаниях по проекту. Офис рядом со ст.м. Водный стадион.\n• Стабильный конкурентный доход, своевременная выплата заработной платы в полном объеме на карту банка.\n• Оформление по ТК РФ (по желанию договор ГПХ или трудовой договор на определенный срок)."}, {"Профессия": "CRM-аналитик", "Заработная плата": "З/П не указана", "Ссылка на вакансию": "https://www.superjob.ru/vakansii/crm-analitik-46430970.html", "Требования к работе": "Обязанности:\n \n• Разработка отчетности по цифровому привлечению (в каналах сайт, мобильный банк и интернет банк) и CRM кампаниям в сегменте состоятельных клиентов.\n \n• Проведение аналитики, исследований, поиск инсайтов по результатам проведенных кампаний, воронкам продаж, этапам жизненного цикла клиента, портфельной аналитике. Формирование аналитических записок и рекомендаций для развития цифрового бизнеса\n \n• Согласование требований и разработка дэшбордов, визуализация данных, презентация отчётов.\n \n• Сегментация данных, формирование и тестирование гипотез, поиск зависимостей, в том числе статистическими методами.\n \n• Участие в разработке моделей склонностей к различным банковским продуктам совместно с кросс-функциональными командами.\n \n• Формирование требований на разработку, оценку и внедрение моделей и алгоритмов, которые поддерживают аналитические решения на основе машинного обучения (ML), выступая в роли бизнес-заказчика у профильных подразделений.\n \n• Выбор и расчет метрик качества моделей (ROC, AUC, интерпретация результатов в привязке к конверсиям по маркетинговым кампаниям).\n \n• Подготовка выгрузок с помощью SQL-скриптов для задач целевого маркетинга (формирование сегментов для запуска кампаний).\n \n• Ad hoc аналитика по запросу .\n \n• Координация действий со смежными подразделениями по развитию жизненного цикла клиента и работе с данными с целью создания комплексных аналитических решений.\n \nТребования:\n \n• Обязательно – опыт работы от 3 лет на позициях, связанных с анализом бизнес-показателей и/или обработкой и анализом данных.\n \n• Обязательно – опыт работы с большими массивами данных в промышленной БД (Greenplum, Teradata, Oracle, MSSQL, PostgreSQL).\n \n• Обязательно – опыт написания сложных SQL-запросов.\n \n• Желательно – опыт работы в любой из ключевых BI систем или готовность научиться в них работать (Qlik, Tableau, Power BI).\n \n• Желательно – опыт владения Python или R, статистических пакетов.\n \n• Желательно – понимание основ машинного обучения и моделирования в таких областях, как кластеризация, классификация, регрессия, выявление аномалий, моделирование и оптимизация, с использованием больших массивов данных.\n \n• Желательно – базовое понимание основных банковских или финансовых продуктов\n \n• Будем плюсом – опыт работы в CRM и Digital маркетинге, X-sell.\n \n• Будет плюсом – понимание базовых принципов работы систем Web-аналитики.\n \n• Обязательно – продвинутый пользователь Microsoft Office (Excel, PowerPoint), желательно базовый уровень опыта PowerPivot, ThinkCell.\n \nУсловия:\n \n• трудоустройство согласно Законодательству;\n \n• конкурентная заработная плата;\n \n• профессиональное обучение и развитие;\n \n• добровольное медицинское страхование, льготные условия кредитования;\n \n• корпоративная пенсионная программа, материальная помощь;\n \n• спортивная жизнь и корпоративные мероприятия;\n \n• возможность построить карьеру в ведущем банке России."}, {"Профессия": "Специалист по парсерам", "Заработная плата": 100000, "Ссылка на вакансию": "https://www.superjob.ru/vakansii/specialist-po-parseram-46449440.html", "Требования к работе": "Вакансия компании \"MARPLA\"\nМARketPLAce - Сервис анализа поисковых запросов на Wildberries.\nОбязанности:\n- Разработка и сопровождение парсера для сбора данных с маркетплейса Wildberries.\nТребования:\n- Положительный опыт работы в команде;\n- Выходить во внерабочее время (при необходимости), для устранения критических и аварийных багов парсера;\n- Высшее техническое образование;\n- Опыт высоконагруженного парсинга:\nмногопоточный парсинг через прокси в несколько тысяч потоков;\nот 100 млн запросов в сутки;\nот 0.5 млрд записей результатов в сутки;\n- Знание python, pandas;\n- Понимание принципов работы поисковых систем, обязательных требований к сайтам;\n- ООП, структуры данных, базовые алгоритмы и понимание их сложности, базовое знание HTML/CSS/JS, базовый Git.\nУсловия:\n- Удаленный формат работы;\n- Разнообразные интересные мотивирующие задачи;\n- Своевременная выплата заработной платы."}]}